Функция ТаблицаЗначенийИзCSVФайла(ИмяФайла, Разделитель = ";", ЗаголовкиИзПервойСтроки = Ложь) Экспорт
	
	Текст = Новый ЧтениеТекста(ИмяФайла, КодировкаТекста.UTF8);
	СимволКавычки = Символ(34);
	Результат = Новый ТаблицаЗначений;
	ТекСтрока = Текст.ПрочитатьСтроку(); 
	
	Если ТекСтрока <> Неопределено Тогда
		
		МассивЗначений = СтрРазделить(ТекСтрока, Разделитель);
		ИндексКолонки = 0;
		
		Для Каждого ИмяКолонки Из МассивЗначений Цикл
			ИмяКолонки = ?(НЕ ЗаголовкиИзПервойСтроки, "Кол" + ИндексКолонки,
			УбратьЛишниеСимволы(ИмяКолонки));
			Результат.Колонки.Добавить(ИмяКолонки);
			ИндексКолонки = ИндексКолонки + 1;
		КонецЦикла; 
		
		Если ЗаголовкиИзПервойСтроки Тогда
			ТекСтрока = Текст.ПрочитатьСтроку();
		КонецЕсли;
		
	КонецЕсли;
	
	Пока ТекСтрока <> Неопределено Цикл 
		
		НоваяСтрока = Результат.Добавить();	
		МассивЗначений = СтрРазделить(ТекСтрока, Разделитель);
		ИндексКолонки = 0;
		
		Для Каждого ТекЗначение Из МассивЗначений Цикл
			
			Если ТипЗнч(ТекЗначение) = Тип("Строка") и СтрНачинаетсяС(ТекЗначение, СимволКавычки) 
				И СтрЗаканчиваетсяНа(ТекЗначение, СимволКавычки) тогда	
				НоваяСтрока[ИндексКолонки] = Сред(ТекЗначение, 2, СтрДлина(ТекЗначение) - 2);
			Иначе
				НоваяСтрока[ИндексКолонки] = ТекЗначение;
			КонецЕсли;
			
			ИндексКолонки = ИндексКолонки + 1;
		КонецЦикла;
		
		ТекСтрока = Текст.ПрочитатьСтроку();
	КонецЦикла;
	
	Возврат Результат;
КонецФункции  

Функция УбратьЛишниеСимволы(ИмяКолонки)
	
    СимволКавычки = Символ(34);
	СимволыНПП = Символы.НПП;
	
	ИмяКолонки = СтрЗаменить(ИмяКолонки, СимволКавычки, "");
	ИмяКолонки = СтрЗаменить(ИмяКолонки, " ", "_");
	ИмяКолонки = СтрЗаменить(ИмяКолонки, СимволыНПП, "_");
	ИмяКолонки = СтрЗаменить(ИмяКолонки, "/", "_");
	
	Возврат ИмяКолонки;
	
КонецФункции

Процедура ПересчитатьСтоимостьОбработки() Экспорт 
	
	ТекущаяДата = ТекущаяДатаСеанса();
	НачалоТекущегоМесяца = НачалоМесяца(ТекущаяДата);
	ПредыдущийМесяц = ДобавитьМесяц(ТекущаяДата,-1);
	НачалоПредыдущегоМесяща = НачалоМесяца(ПредыдущийМесяц);
	КонецПредыдущегоМесяща = КонецМесяца(ПредыдущийМесяц);
	
	НаборКонстант = Константы.СоздатьНабор("СтоимостьобработкиМГТ, СтоимостьобработкиШин, СтоимостьобработкиКГТ"); 
	НаборКонстант.Прочитать();
	СтоимостьобработкиМГТ = НаборКонстант.СтоимостьобработкиМГТ; 
	СтоимостьобработкиШин = НаборКонстант.СтоимостьобработкиШин;
	СтоимостьобработкиКГТ = НаборКонстант.СтоимостьобработкиКГТ; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Приход.Ссылка) КАК КоличествоНаХабе
	|ИЗ
	|	Документ.Приход КАК Приход
	|ГДЕ
	|	(Приход.ДатаПрибытия МЕЖДУ &ДатаНачало И &ДатаКонец
	|			ИЛИ Приход.ДатаУбытия МЕЖДУ &ДатаНачало И &ДатаКонец)
	|	И Приход.Проведен";
	
	Запрос.УстановитьПараметр("ДатаНачало", НачалоПредыдущегоМесяща);
	Запрос.УстановитьПараметр("ДатаКонец", КонецПредыдущегоМесяща);
	
	РезультатЗапроса = Запрос.Выполнить();  
	
	Если РезультатЗапроса.Пустой() Тогда 
		СтоимостьОбработкиХаб = 500;
	Иначе
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		Если ВыборкаДетальныеЗаписи.КоличествоНаХабе < 500 Тогда 
			СтоимостьОбработкиХаб = 500;
		ИначеЕсли ВыборкаДетальныеЗаписи.КоличествоНаХабе < 1000 Тогда 
			СтоимостьОбработкиХаб = 200;
		ИначеЕсли ВыборкаДетальныеЗаписи.КоличествоНаХабе < 2000 Тогда 
			СтоимостьОбработкиХаб = 100;
		ИначеЕсли ВыборкаДетальныеЗаписи.КоличествоНаХабе < 5000 Тогда 
			СтоимостьОбработкиХаб = 70;
		Иначе
			СтоимостьОбработкиХаб = 50;
		КонецЕсли; 
		
	КонецЕсли;	
	
	НаборЗаписей = РегистрыСведений.ТарифыНаОбработку.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Период.Установить(НачалоТекущегоМесяца);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() Тогда 
		ВызватьИсключение("В этом месяце уже были установлены тарифы на обработку");
	КонецЕсли;	
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = НачалоТекущегоМесяца; 
	НоваяЗапись.ТипГрузовогоМеста = Перечисления.ТипыГрузовогоМеста.МГТ; 
	НоваяЗапись.Стоимость = СтоимостьобработкиМГТ; 
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = НачалоТекущегоМесяца; 
	НоваяЗапись.ТипГрузовогоМеста = Перечисления.ТипыГрузовогоМеста.Шины; 
	НоваяЗапись.Стоимость = СтоимостьобработкиШин;
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = НачалоТекущегоМесяца; 
	НоваяЗапись.ТипГрузовогоМеста = Перечисления.ТипыГрузовогоМеста.КГТ; 
	НоваяЗапись.Стоимость = СтоимостьобработкиКГТ; 
	
	НоваяЗапись = НаборЗаписей.Добавить(); 
	НоваяЗапись.Период = НачалоТекущегоМесяца; 
	НоваяЗапись.ТипГрузовогоМеста = Перечисления.ТипыГрузовогоМеста.Хаб; 
	НоваяЗапись.Стоимость = СтоимостьОбработкиХаб;
	
	НаборЗаписей.Записать(); 
	
КонецПроцедуры	
