
&НаКлиенте
Процедура Загрузить(Команда) 
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие); 
	Фильтр = "*.csv"; 
	Диалог.Фильтр = Фильтр;
    Диалог.МножественныйВыбор = Истина; 
	Диалог.Заголовок = "Выберите файлы для загрузки операций по услугам"; 
	
	Если Диалог.Выбрать() Тогда
		ВыбранныеФайлы = Диалог.ВыбранныеФайлы;
	Иначе 
		Предупреждение("Файлы для загрузки не выбраны");
		Возврат
	КонецЕсли;  
	
	//Индекс = 1;  
	КоличествоПараллельноРаботающихПотоков = 5;
	КоличествоНаПеренос = ВыбранныеФайлы.Количество(); 
	Задания = Новый Массив;

	Для Каждого Файл из ВыбранныеФайлы Цикл   
		ДвоичныеДанныеФайла = Новый ДвоичныеДанные(Файл);
		
		Задание = ДлительныеОперации.НовоеЗадание(); 
		Задание.ИмяМетода = "ОбщегоНазначенияСервер.ЗагрузитьДокументыПрихода";
		Задание.Параметры.Добавить(ДвоичныеДанныеФайла);					
		Задания.Добавить(Задание);
		
		// Для отладки без фоновых
		//Если Отладка тогда
			//ОбщегоНазначенияСервер.ЗагрузитьДокументыПрихода(ДвоичныеДанныеФайла);
		//КонецЕсли;
		
	КонецЦикла;	
	//
	//Если НЕ Отладка тогда
	ДлительныеОперации.ВыполнитьЗадания(Задания, КоличествоПараллельноРаботающихПотоков);	
	//КонецЕсли;
	//	
КонецПроцедуры 

