
&НаКлиенте
Процедура Загрузить(Команда) 
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие); 
	Фильтр = "*.csv"; 
	Диалог.Фильтр = Фильтр;
    Диалог.МножественныйВыбор = Истина; 
	Диалог.Заголовок = "Выберите файлы для загрузкиопераций по услугам"; 
	
	Если Диалог.Выбрать() Тогда
		ВыбранныеФайлы = Диалог.ВыбранныеФайлы;
	Иначе 
		Предупреждение("Файлы для загрузки не выбраны");
		Возврат
	КонецЕсли; 
	
	ЗагрузитьНаСервере(ВыбранныеФайлы);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(ВыбранныеФайлы)  
	
	Для Каждого Файл из ВыбранныеФайлы Цикл 
		РезультатЧтенияФайла = ОбщегоНазначенияСервер.ТаблицаЗначенийИзCSVФайла(Файл, ",", Истина);
		СоздатьДокументПриход(РезультатЧтенияФайла);
	КонецЦикла;
	
КонецПроцедуры 

Процедура СоздатьДокументПриход(РезультатЧтенияФайла);
	
	Для Каждого Операция Из РезультатЧтенияФайла Цикл 
		НовыйДокПриход = Документы.Приход.СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(НовыйДокПриход, Операция);
		НовыйДокПриход.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла; 
	
КонецПроцедуры	

